/*
d) Напишите программу, которая вход принимает число и выдаёт его квадрат (число умноженное на само себя).
*/
 
 Console.WriteLine("Vvedite chislo: ");
 int number = Convert.ToInt32(Console.ReadLine());
 int result = number * number;
 Console.WriteLine(result);